d = {"a": 1}
print(d.get("a"), d.get("b"), d.get("b", 0)) # 1, None, 0

for k, v in {"x": 1, "y": 2}.items():
    print(k, v)
# x, 1
# y, 2

from collections import Counter
c = Counter("abracadabra")
print(c["a"], c["z"]) #  предположение:  5, Key Error
# ----- Моё объяснение почему это не так ------
# на самом деле выведет 5, 0 потому что у Counter можно попросить любой ключ и он скажет
# количество
print(c.most_common(2)) # предположение: думаю выведет b типа самый подходящий к числу 2
# ----- Моё объяснение почему это не так ------
# эта функция выводит самые большие по количеству и "2" тут значит вывести первые 2
# выведиться [(a, 5), (b, 2)]

from collections import defaultdict
dd = defaultdict(int)
dd["kot"] += 1
dd["kot"] += 1
print(dd["kot"], dd["pes"], len(dd)) # предположение:  2, Key Error, 1
# ----- Моё объяснение почему это не так ------
# тут вывод 2 0 2
# потому что при любом обращении по неизвестному ключу в defaultdict создаст новый ключ
# то есть создался ключ pes а ещё если ключ не известный он не выведет ошибку как раз таки создаст просто новый с тем типом
# который указали поэтому dd['pes'] вывел '0'
# а т.к создался новый ключ их теперь '2'

dl = defaultdict(list)
dl["fruits"].append("apple")
print(dict(dl)) # {"fruits": ["apple"]}
# тут я самого важного не понял то что ключ 'fruits' не существовал и в defaultdict его можно сразу вызвать и он создается

print(d["b"]) # Key Error