# 1. Аргументы
def greet(name, greeting="Привет"):
    return f"{greeting}, {name}!"

print(greet("Эмиль")) # Привет, Эмиль!
print(greet("Эмиль", "Здорово")) # Здорово, Эмиль!
print(greet(greeting="Хай", name="Эмиль")) # Хай, Эмиль!

# 2. Значение по умолчанию
def add_item(item, items=[]):
    items.append(item)
    return items

print(add_item(1)) # [1]
print(add_item(2)) # [2]
# тут должно быть [1, 2] потому что добавляется в тот же список в памяти
print(add_item(3, [])) # [3]
# тут правильно тк указывается свой список
print(add_item(4)) # [4]
# тут должно быть [1, 2, 4] потому что добавляется в тот же список в памяти

# 3. *args и **kwargs
def f(*args, **kwargs):
    print(args, kwargs)

f(1, 2, a=3, b=4) # 1 2 3 4
# тут я забыл что аргументы без "=" создаются а kwargs с "="
# вывод должен быть (1, 2) {'a': 3, 'b': 4} похоже аргументы выводятся в tuple, а kwargs как dict
f() # пусто
# тут вывод должен быть () {} значит аргументы tuple а kwargs это словарь

# 4. Области видимости
x = 10
def g():
    x = 20
    print(x)

g() # 20
print(x) # 10

# 5. Ещё про области видимости
count = 0
def inc():
    count += 1

inc() # 1
# тут оказывается вообще ошибка а я думал count += 1 просто создаст новое число 
# я был прав но не совсем count пытается создаться вот так: сount = count + 1 и тут после "=" оно пытается получиться значение count
# которое ещё не задано а глобальную он не возьмет потому что спереди стоит присваивание "count = " то есть создается локальная переменная
# но присваивание может быть вообще где угодно в функции даже ниже попытки получить её
print(count) # 0
