nums = [1, 2, 3, 4, 5]
print([n * 2 for n in nums])
print([n for n in nums if n % 2 == 0])
print({n: n ** 2 for n in nums if n > 3})
print({len(w) for w in ["кот", "пёс", "мышь"]})
print([w.lower() for w in ["Кот", "пёс", "МЫШЬ"]])
print([(a, b) for a in [1, 2] for b in "xy"])

# мои предсказания:
# [1, 4, 6, 8, 10]
# [2, 4]
# {n: 25}
# {3, 4}
# ["кот", "пёс","мышь"]
# [(1,x), (1,y), (2,x), (2,y)]

# Результат и мои объяснения
# [2, 4, 6, 8, 10] - ну тут я просто тупанул 1*2 как 1 посчитал
# правильно
# {4: 16, 5: 25} - я забыл что "n:" - тут переменная из-за этого я подумал что два ключа "n" быть не может
# правильно
# правильно
# правильно